# -*- coding: utf-8 -*-
__author__ = 'Lev'


not_allowed = 'Не, такие команды может отдавать только Лев'
ok = 'Ладно.'
ok_lev = 'Да, магистр.'
completing = 'Выполняю.'
completing_lev = 'Выполняю, магистр.'
completed = 'Готово.'
completed_lev = 'Готово, магистр.'
voice = 'Гаф-гаф'
bad_command = 'Не надо так делать'
images_not_allowed = 'Ввиду жадности гугла данный сервис пока что доступен только Льву'
images_ended = 'Кончились картинки'
no_text_message = 'У меня нет слов'
no_such_music = 'Нет такой музыки'
no_music = 'Нет больше музыки, спасибо разрабам ВК'
no_such_video = 'Нет такого видео'
no_image_attached = 'Не вижу картинки'
no_found_on_image = 'Ничего я тут не нашел'
microsoft_services_not_allowed = 'Ввиду жадности микрософта данный сервис пока что доступен только Льву'
breaking_news = 'Свежие новости'
post_ready = 'Вот'
many_messages_count = 'Не, больше 10 многовато'
no_messages_count = 'Нет столько сообщений'
no_lessons = 'Нет пар сегодня'
some_error = 'Ошибка какая-то'
no_more_voice = 'Сегодня я не буду больше говорить. Наговорился'
voice_problems = 'Не, не хочу разговаривать'
wiki_not_found = 'Без понятия'
no_weather = 'Не погодится'
trigger_exists = 'Такой триггер уже есть'
no_trigger = 'Такого триггера нет'
no_triggers = 'Триггеров нет'
now_triggers = 'Текущие триггеры:'
abs_trigger = '*Абсолютный триггер*'
no_translate = 'Я так не буду переводить'
many_languages_trace = 'Ну слишком много, лучше 20 максимально'
func_description = 'Описание функций (обращаться ко мне нужно по имени, "Гyдвин"):\n' \
                   '1) Диалог\n2) Монолог\n3) Гифки\n4) Картинки (запрос в кавычках)\n5) Музыка (запрос в кавычках)\n' \
                   '6) Видео (запрос в кавычках)\n7) Новости\n8) Нормальные новости\n9) Треш\n10) Анализ картинок\n' \
                   '11) Картинки с описанием (запрос в кавычках)\n12) Смена лексикона\n13) Смена интерфейса\n' \
                   '14) Анализ тональности (количество сообщений в кавычках)\n15) Где пaры\n' \
                   '16) Разрешение/запрет на картинки\n17) Разрешение/запрет на анализ картинок\n' \
                   '18) Разрешение/запрет на анализ тональности\n19) Голос\n' \
                   '20) Скажи (запрос в кавычках)\n' \
                   '21) Kоторый час\n22) Погoда\n23) Вики (запрос в кавычках)\n' \
                   '24) Языки\n25) Перевод (язык)\n26) Трассировка языков (языки через пробел в кавычках)\n' \
                   '27) Смена языка (язык)\n28) Описание функций\n'

